Revit 2024 API
BuiltInFailures.EditingFailures.CannotMoveLocked Property
 Can't move pinned element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotMoveLocked { get; }
Visual Basic
Public Shared ReadOnly Property CannotMoveLocked As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotMoveLocked {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace